{
  "company": "Zebra",
  "timestamp": "2025-07-31 11:14:42",
  "source_url": "https://zebra.eightfold.ai/careers?location=India",
  "configuration": {
    "company": "Zebra",
    "url": "https://zebra.eightfold.ai/careers?location=India",
    "job_card": ".job-card-container.list",
    "title": "h3",
    "click_target": "h3",
    "location": ".stack-module_stack__LqslD.stack-module_horizontal__m-79-.stack-module_xxs__ydvYL",
    "posted_selector": "div[data-automation-id='postedOn']",
    "pagination_selector": "button.btn.btn-sm.btn-secondary.show-more-positions",
    "pagination_type": "Load_more",
    "detail_selectors": {
      "title": [
        "h1[data-automation-id='jobPostingHeader']",
        "h1",
        ".job-title"
      ],
      "description": [
        "[data-automation-id='jobPostingDescription']",
        ".position-job-description",
        "[data-automation-id='description']"
      ],
      "requirements": [
        "[data-automation-id='qualifications']",
        ".qualifications",
        "[class*='requirement']"
      ],
      "location": [
        "[data-automation-id='locations']",
        ".location",
        "[class*='location']"
      ],
      "employment_type": [
        "[data-automation-id='employmentType']",
        ".employment-type"
      ],
      "posted_date": [
        "[data-automation-id='postedOn']",
        ".posted-date"
      ]
    }
  },
  "total_jobs": 10,
  "jobs": [
    {
      "title": "Jobs at Zebra",
      "location": "India×",
      "posted_date": "N/A",
      "apply_link": "https://zebra.eightfold.ai/careers?location=India&pid=343627662308&domain=zebra.com&sort_by=relevance",
      "description": "Remote Work: NoOverview: At Zebra, we are a community of innovators who come together to create new ways of working to make everyday life better. United by curiosity and care, we develop dynamic solutions that anticipate our customer’s and partner’s needs and solve their challenges.\n Being a part of Zebra Nation means being seen, heard, valued, and respected. Drawing from our diverse perspectives, we collaborate to deliver on our purpose. Here you are a part of a team pushing boundaries to redefine the work of tomorrow for organizations, their employees, and those they serve.\n You have opportunities to learn and lead at a forward-thinking company, defining your path to a fulfilling career while channeling your skills toward causes that you care about – locally and globally. We’ve only begun reimaging the future – for our people, our customers, and the world. Let’s create tomorrow together.Analyzes, develops, designs, and maintains software for the organization's products and systems. Performs system integration of software and hardware to maintain throughput and program consistency. Develops, validates, and tests: structures and user documentation. Work may be reviewed for accuracy and overall adequacy. Follows established processes and directions.Responsibilities:Designs, develops, and tests on a variety of software assignments that constitute a portion of a larger projectDevelops and tests documentation which describes the specific software functionalityParticipates and provides some input in project code reviewsRuns software tests designed by more experienced engineersReviews test results and perform root cause analyses to identify problemsProvides recommendations and implements solutions to complex issues. Insures compliance with quality process and standardsMakes changes to or upgrades existing software. Enhances and improves existing technologies to apply to new solutionsMakes and implements recommendations to immediate team to enhance performance and improve productivity  Seeks out new tools to analyze and solve problemsExercises judgment within defined procedures and practices to determine appropriate actionReceives general instructions on routine work, new projects or assignmentsMay provide guidance to non-exempt personnelBuilds productive working relationships internally and externallyPrimary intra-organizational with occasional inter-organizational and external customer contacts on routine mattersFamiliarity with cloud platforms (GCP) , natural language processing (NLP), LLM and Co-PilotContribute to continuous improvement by researching and applying new AI techniques and cloud technologies. Qualifications:Preferred Education: Bachelor's or Masters degree in an appropriate engineering discipline required.Preferred Work Experience (years):Bachelors degree and 2+ years or Masters degree with no experience.All Other Regions: Bachelor’s or Master’s degree in an appropriate engineeringdiscipline requiredPreferred work experience (years): 2+ years experience To protect candidates from falling victim to online fraudulent activity involving fake job postings and employment offers, please be aware our recruiters will always connect with you via @zebra.com email accounts. Applications are only accepted through our applicant tracking system and only accept personal identifying information through that system.  Our Talent Acquisition team will not ask for you to provide personal identifying information via e-mail or outside of the system. If you are a victim of identity theft contact your local police department.",
      "requirements": "N/A",
      "employment_type": "N/A",
      "experience_level": "N/A",
      "department": "N/A",
      "company": "Zebra",
      "scraped_at": "2025-07-31 11:06:47",
      "page_number": 1,
      "source_url": "https://zebra.eightfold.ai/careers?location=India"
    },
    {
      "title": "Jobs at Zebra",
      "location": "India×",
      "posted_date": "N/A",
      "apply_link": "https://zebra.eightfold.ai/careers?location=India&pid=343627635632&domain=zebra.com&sort_by=relevance",
      "description": "Remote Work: NoOverview:At Zebra, we are a community of innovators who come together to create new ways of working to make everyday life better. United by curiosity and care, we develop dynamic solutions that anticipate our customer’s and partner’s needs and solve their challenges.Being a part of Zebra Nation means being seen, heard, valued, and respected. Drawing from our diverse perspectives, we collaborate to deliver on our purpose. Here you are a part of a team pushing boundaries to redefine the work of tomorrow for organizations, their employees, and those they serve.You have opportunities to learn and lead at a forward-thinking company, defining your path to a fulfilling career while channeling your skills toward causes that you care about – locally and globally. We’ve only begun reimaging the future – for our people, our customers, and the world.Let’s create tomorrow together.This is an opportunity to join a growing team in a dynamic new business opportunity within Zebra. Zebra Technologies located in Bangalore revolutionizes the way work is done in large warehouses and distribution centers with innovative robotic solutions. Our team members include robotics and software experts with multidisciplinary backgrounds. We are seeking software engineers to join the Zebra Team!As the key backend developer, you will be asked to interpret the business requirements as provided by the product owner and translate those requirements into a design, an application and supporting DB schema. Careful design with solid implementations will be key to success in this role.Position Description: Zebra is looking for passionate, talented software engineers to join the tight knit team that designs and builds our cloud robotics platform which powers fleets of robots deployed at our customer sites.This is a very specific and remarkable greenfield opportunity. You will partner closely with cloud software, infrastructure and robotics teams Responsibilities:Design, develop and deploy core components of our next generation cloud robotics platform.Work closely with the product and other engineering teams to envision and drive the technical roadmap for cloud robotics platformInfluence larger team's technical and collaborative culture and processes by growing and mentoring other engineersWork with business analyst to understand our customer’s business processing needs.Work with the DevOps teams to ensure a smooth, automated test and deployment for the application. Qualifications:Preferred Education: Bachelor's degree 3-6 years of relevant work experience in server side and/or data engineering development.Outstanding abstraction skills to decouple complex problems into simple concepts.Software development using programming languages Go, PythonStrong knowledge in any one of the cloud technologies like AWS/Google Cloud/AzureExperience with automated testing, Unit testing, deployment pipelines and cloud based infrastructure.Experience in Docker, KubernetesStrong understanding of databases, NoSQL data stores, storage and distributedpersistence technologiesExperience with cloud-based architectures: SaaS, Micro-ServicesExperience in Design principle patterns & system designProficient understanding of code versioning tools, such as GitStrong knowledge on data structures, algorithms and problem-solving skillsPassionate about enabling next generation experiencesGood Analytical, Problem solving and Debugging skills.Experience in greenfield architecture and well-crafted, elegant systems.Demonstrated ability to find the best solution for the problem at hand.Highly collaborative and open working style.Desired:Good understanding on REST, gRPC and GraphQLExperience with robotics and embedded systems development.Experience with 3rd party data platforms (e.g., Snowflake, Spark, Databricks).Experience integrating with 3rd party monitoring tools (e.g., Prometheus, Kibanna, Grafana).Experience working at deployment and infrastructure level.What We Offer:Competitive salary.Zebra Incentive Program (annual performance bonus)Zebra’s GEM appreciation/recognition programFlexible time off - work hard & play hard.Awesome company culture and ability to work with robots!Zebra’s culture is encouraging and collaborative where our employees are encouraged to learn and grow together. As we celebrate our 5 decades of success, this is a phenomenal time to join us and make your mark for the 6th one. We are excited to hear from you!”To protect candidates from falling victim to online fraudulent activity involving fake job postings and employment offers, please be aware our recruiters will always connect with you via @zebra.com email accounts. Applications are only accepted through our applicant tracking system and only accept personal identifying information through that system. Our Talent Acquisition team will not ask for you to provide personal identifying information via e-mail or outside of the system. If you are a victim of identity theft contact your local police de",
      "requirements": "N/A",
      "employment_type": "N/A",
      "experience_level": "N/A",
      "department": "N/A",
      "company": "Zebra",
      "scraped_at": "2025-07-31 11:07:26",
      "page_number": 1,
      "source_url": "https://zebra.eightfold.ai/careers?location=India"
    },
    {
      "title": "Jobs at Zebra",
      "location": "India×",
      "posted_date": "N/A",
      "apply_link": "https://zebra.eightfold.ai/careers?location=India&pid=343627589205&domain=zebra.com&sort_by=relevance",
      "description": "Remote Work: HybridOverview: At Zebra, we are a community of innovators who come together to create new ways of working to make everyday life better. United by curiosity and care, we develop dynamic solutions that anticipate our customer’s and partner’s needs and solve their challenges.\n Being a part of Zebra Nation means being seen, heard, valued, and respected. Drawing from our diverse perspectives, we collaborate to deliver on our purpose. Here you are a part of a team pushing boundaries to redefine the work of tomorrow for organizations, their employees, and those they serve.\n You have opportunities to learn and lead at a forward-thinking company, defining your path to a fulfilling career while channeling your skills toward causes that you care about – locally and globally. We’ve only begun reimaging the future – for our people, our customers, and the world. Let’s create tomorrow together.We are seeking a highly skilled and motivated Data Scientist (LLM Specialist) to join our AI/ML team. This role is ideal for an individual passionate about Large Language Models (LLMs), workflow automation, and customer-centric AI solutions. You will be responsible for building robust ML pipelines, designing scalable workflows, interfacing with customers, and independently driving research and innovation in the evolving agentic AI space.Key Responsibilities:LLM Development & Optimization: Train, fine-tune, evaluate, and deploy Large Language Models (LLMs) for various customer-facing applications.Pipeline & Workflow Development: Build scalable machine learning workflows and pipelines that facilitate efficient data ingestion, model training, and deployment.Model Evaluation & Performance Tuning: Implement best-in-class evaluation metrics to assess model performance, optimize for efficiency, and mitigate biases in LLM applications.Customer Engagement: Collaborate closely with customers to understand their needs, design AI-driven solutions, and iterate on models to enhance user experiences.Research & Innovation: Stay updated on the latest developments in LLMs, agentic AI, reinforcement learning with human feedback (RLHF), and generative AI applications. Recommend novel approaches to improve AI-based solutions.Infrastructure & Deployment: Work with MLOps tools to streamline deployment and serve models efficiently using cloud-based or on-premise architectures, including Google Vertex AI for model training, deployment, and inference.Foundational Model Training: Experience working with open-weight foundational models, leveraging pre-trained architectures, fine-tuning on domain-specific datasets, and optimizing models for performance and cost-efficiency.Cross-Functional Collaboration: Partner with engineering, product, and design teams to integrate LLM-based solutions into customer products seamlessly.Ethical AI Practices: Ensure responsible AI development by addressing concerns related to bias, safety, security, and interpretability in LLMs.Responsibilities:Experience: experience in ML, NLP, or AI-related roles, with a focus on LLMs and generative AI.Programming Skills: Proficiency in Python and experience with ML frameworks like TensorFlow, PyTorchLLM Expertise: Hands-on experience in training, fine-tuning, and deploying LLMs (e.g., OpenAI’s GPT, Meta’s LLaMA, Mistral, or other transformer-based architectures).Foundational Model Knowledge: Strong understanding of open-weight LLM architectures, including training methodologies, fine-tuning techniques, hyperparameter optimization, and model distillation.Data Pipeline Development: Strong understanding of data engineering concepts, feature engineering, and workflow automation using Airflow or Kubeflow.Cloud & MLOps: Experience deploying ML models in cloud environments like AWS, GCP (Google Vertex AI), or Azure using Docker and Kubernetes.Model Serving & Optimization: Proficiency in model quantization, pruning, distillation, and knowledge distillation to improve deployment efficiency and scalability.Research & Problem-Solving: Ability to conduct independent research, explore novel solutions, and implement state-of-the-art ML techniques.Strong Communication Skills: Ability to translate technical concepts into actionable insights for non-technical stakeholders.Version Control & Collaboration: Proficiency in Git, CI/CD pipelines, and working in cross-functional teams.Qualifications:Bachelor’s in Computer Science, Machine learning, or related discipline.Master’s preferredStrong background in statistics, machine learning, deep learning and programming necessary. 5+years experience requiredExperience in solving large-scale real-world industry problems, preferably in collaboration with cross-functional, multi-disciplinary teamsKnowledge of statistical programming techniques and languages (e.g., R, Python, Java, etc.)Working knowledge of common machine learning and deep learning approaches (e.g. regression, clustering, classification, dimensionality reduction, supervised and unsupervised t",
      "requirements": "N/A",
      "employment_type": "N/A",
      "experience_level": "N/A",
      "department": "N/A",
      "company": "Zebra",
      "scraped_at": "2025-07-31 11:08:05",
      "page_number": 1,
      "source_url": "https://zebra.eightfold.ai/careers?location=India"
    },
    {
      "title": "Jobs at Zebra",
      "location": "India×",
      "posted_date": "N/A",
      "apply_link": "https://zebra.eightfold.ai/careers?location=India&pid=343627444625&domain=zebra.com&sort_by=relevance",
      "description": "Remote Work: HybridOverview: At Zebra, we are a community of innovators who come together to create new ways of working to make everyday life better. United by curiosity and care, we develop dynamic solutions that anticipate our customer’s and partner’s needs and solve their challenges.\n Being a part of Zebra Nation means being seen, heard, valued, and respected. Drawing from our diverse perspectives, we collaborate to deliver on our purpose. Here you are a part of a team pushing boundaries to redefine the work of tomorrow for organizations, their employees, and those they serve.\n You have opportunities to learn and lead at a forward-thinking company, defining your path to a fulfilling career while channeling your skills toward causes that you care about – locally and globally. We’ve only begun reimaging the future – for our people, our customers, and the world. Let’s create tomorrow together.As a Product Manager Software Solutions, you will orchestrate the product definition, positioning,pricing and lifecyle management of a product line (product series) within a family of products. Youare responsible for leading interactions with every organization responsible for the development,production, marketing, sales, and service of the product line to ensure successful business results andsatisfies customer needs.Responsibilities:• Determine product offerings and driving development, launch and adoption of product topositively impact the customers’ experience and market share.• Translate business priorities and customer expectations into user stories so that thesoftware development team can build solutions that excite users.• Work with the software development teams to ensure clarity of requirements and makenecessary adjustments to best meet customer needs• Balance feature value against cost to build and communicate tradeoffs to Sr. ProductManager.• Prioritize and maintain product backlog and collaborate with software teams to agreeon sprint backlog that meets sprint goals.• Validate user acceptance testing.• Triage and prioritize issues identified throughout the sprint.• Collaborate with Sr. Product Manager to convert market analysis into a coherentrequirement including feature prioritization, cost, sales volume, and profitabilityexpectations.• Collaborate with Sr. Product Manager to conduct market, customer, and competitiveanalysis in order to understand customer needs for his/her product line.• Lead all aspects of the product launch plans to assure that his/her product is presentedto the market as intended by the strategy.Qualifications:• Bachelor’s degree required.• Minimum 8 years’ experience in a software organization, product owner or related role.• Experience with SaaS based enterprise software products and associated mobile application and aclear understanding of how to design the product for easy adoption by end users is essential. Preferred verticals expereince as retail, helathcare and general supplychain. Communication experience ,voice /video calls and push to talk and PBX. Strong execution skills with the ability to prioritize and deliver needs on time to the Senior Manager of Product Management.• Must be a self-starter who is very driven, with a go-getter attitude.• Scrum Certification (PSPO or CSPO).• Ability to travel 10 to 20% of the time and telework. U.S. Only – Frequency Definitions for Physical Activities, Environmental Conditions andPhysical Demands:Never – 0%Occasionally - 0-20 times per shift or up to 33% of the timeFrequently - 20-100 times per shift or 33-66% of the timeConstantly - Over 100 times per shift or 66-100% of the time Physical Activities (U.S. only):Select the frequency for each item on the below list (never, occasionally, frequently, constantly).• Ascending or descending ladders, stairs, scaffolding, ramps, poles and the like. (Never)• Working from heights such as roofs, ladders, or powered lifts. (Never)• Moving self in different positions to accomplish tasks in various environments including awkwardor tight and confined spaces. (Never)• Remaining in a stationary position, often standing or sitting for prolonged periods. (Frequently)• Stooping, kneeling, bending, crouching, reaching, pushing/pulling. (Never)• Moving about to accomplish tasks or moving from one worksite to another. (Occasionally)• Adjusting or moving objects up to ## pounds in all directions. (Never)• Communicating with others to exchange information. (Frequently)• Repeating motions that may include the wrists, hands and/or fingers. (Frequently)• Operating machinery and/or power tools. (Never)• Operating motor vehicles, industrial vehicles, or heavy equipment. (Never)• Assessing the accuracy, neatness and thoroughness of the work assigned. (Occasionally) Environmental Conditions (U.S. only):Select the frequency for each item on the below list (never, occasionally, frequently, constantly).• Exposure to extreme temperatures (high or low). (Never)• Outdoor elements such as precipitation and wind. (Never)• Nois",
      "requirements": "N/A",
      "employment_type": "N/A",
      "experience_level": "N/A",
      "department": "N/A",
      "company": "Zebra",
      "scraped_at": "2025-07-31 11:08:43",
      "page_number": 1,
      "source_url": "https://zebra.eightfold.ai/careers?location=India"
    },
    {
      "title": "Jobs at Zebra",
      "location": "India×",
      "posted_date": "N/A",
      "apply_link": "https://zebra.eightfold.ai/careers?location=India&pid=343627113504&domain=zebra.com&sort_by=relevance",
      "description": "Remote Work: HybridOverview: At Zebra, we are a community of innovators who come together to create new ways of working to make everyday life better. United by curiosity and care, we develop dynamic solutions that anticipate our customer’s and partner’s needs and solve their challenges.\n Being a part of Zebra Nation means being seen, heard, valued, and respected. Drawing from our diverse perspectives, we collaborate to deliver on our purpose. Here you are a part of a team pushing boundaries to redefine the work of tomorrow for organizations, their employees, and those they serve.\n You have opportunities to learn and lead at a forward-thinking company, defining your path to a fulfilling career while channeling your skills toward causes that you care about – locally and globally. We’ve only begun reimaging the future – for our people, our customers, and the world. Let’s create tomorrow together.The Global Trade Compliance team is responsible to support all business functions related to cross- border transactions.Responsibilities:Essential Duties and Responsibilities:Policies, Procedures, Processes (Creation & Implementation)o Creates processes and procedures related to International Trade Compliance;o  Applies experience and advanced research skills to updating and maintaining procedures, processes, and policies.–    Systems & Product Database Management / Trade Data Management (e.g., HTS, ECCN, COO)o  Analyzes and creates the process for maintaining trade compliance elements in the item databases.o Superuser for at least one trade system / tool.–    Regulatory Updates & Guidance to Various Internal & External Stakeholderso Research legal regulatory requirements.–    Clearance / Processes / Export Controls (Export, Import or Both)o  When necessary, prepares paperwork required for import, processes ECOs with trade compliance attributes.o Interacts with various levels of stakeholders to ensure full support of the operations.o Classifies Zebra's items in Harmonized Tariff Schedule (HS numbers) and/or Export Controls Commodity Number.o Validates classifications.–    Recordkeepingo Recommends and establishes policies and procedures for recordkeepingNote: The statements herein are intended to describe the general nature and level of work being performed by employees and are not to be construed as an exhaustive list of responsibilities, duties, abilities, and skills required of personnel so classified.Qualifications:Job Requirements:Minimum Education:Bachelor’s Degree, and an advanced degree or consulting work experience (at Big 5) is preferred. Preferred focus of the advanced degree is Business, Finance, Communication or Law.Minimum Work Experience (years):Minimum of 5 years of direct trade compliance work experience, such as regulatory work experience with import or export laws and regulations is required. At least 2 years of continuous commodity classification (export or import) experience is preferred.Key Skills and Competencies:Export license application experience, including commodity classification determinations, commodity jurisdiction, sanctions work, etc. is preferredExcellent writing skills are requiredExcellent communication skills are requiredProject Management knowledge is requiredAdvanced knowledge of MS Word and Excel is requiredLicenses/Certifications, special qualifications:n/aEquivalencies:n/a  Position Specific Information:Travel Requirements (as a % of time): less than 5% on an “as needed” basisAble to telework? Yes/no – if yes, % of time and expectations while teleworking: yesPersonal Protective Equipment (PPE) Required (safety glasses, steel-toed boots, gloves, etc.): No  U.S. Only – Frequency Definitions for Physical Activities, Environmental Conditions and Physical Demands:Never – 0%Occasionally - 0-20 times per shift or up to 33% of the timeFrequently - 20-100 times per shift or 33-66% of the timeConstantly - Over 100 times per shift or 66-100% of the time Physical Activities (U.S. only):Select the frequency for each item on the below list (never, occasionally, frequently, constantly).Ascending or descending ladders, stairs, scaffolding, ramps, poles and the like. ( Never)Working from heights such as roofs, ladders, or powered lifts. ( Never)Moving self in different positions to accomplish tasks in various environments including awkward or tight and confined spaces. ( Never)Remaining in a stationary position, often standing or sitting for prolonged periods. ( Frequently)Stooping, kneeling, bending, crouching, reaching, pushing/pulling. ( Occasionally)Moving about to accomplish tasks or moving from one worksite to another. ( Never)Adjusting or moving objects up to ## pounds in all directions. ( Never)Communicating with others to exchange information. ( Frequently)Repeating motions that may include the wrists, hands and/or fingers. ( Frequently)Operating machinery and/or power tools. ( Never)Operating motor vehicles, industrial vehicles, or heavy equipment. ( Never)Assessing the accuracy, nea",
      "requirements": "N/A",
      "employment_type": "N/A",
      "experience_level": "N/A",
      "department": "N/A",
      "company": "Zebra",
      "scraped_at": "2025-07-31 11:09:24",
      "page_number": 1,
      "source_url": "https://zebra.eightfold.ai/careers?location=India"
    },
    {
      "title": "Jobs at Zebra",
      "location": "India×",
      "posted_date": "N/A",
      "apply_link": "https://zebra.eightfold.ai/careers?location=India&pid=343626991474&domain=zebra.com&sort_by=relevance",
      "description": "Remote Work: HybridOverview: At Zebra, we are a community of innovators who come together to create new ways of working to make everyday life better. United by curiosity and care, we develop dynamic solutions that anticipate our customer’s and partner’s needs and solve their challenges.\n Being a part of Zebra Nation means being seen, heard, valued, and respected. Drawing from our diverse perspectives, we collaborate to deliver on our purpose. Here you are a part of a team pushing boundaries to redefine the work of tomorrow for organizations, their employees, and those they serve.\n You have opportunities to learn and lead at a forward-thinking company, defining your path to a fulfilling career while channeling your skills toward causes that you care about – locally and globally. We’ve only begun reimaging the future – for our people, our customers, and the world. Let’s create tomorrow together.Analyzes, develops, designs, and maintains software for the organization's products and systems. Performs system integration of software and hardware to maintain throughput and program consistency. Develops, validates, and tests: structures and user documentation. Work may be reviewed for accuracy and overall adequacy. Follows established processes and directions.Responsibilities:Establishes requirements for less complex design projectsWorks on Completing all phases of Software engineering design projectsWorks on analysis of processes and delivers results to necessary stakeholdersAnalyzes results and recommends solutionsWorks on developing expected results on a variety of productsDevelops documentation for new projects and reviews previous resultsWorks with latest technologies and new approachesReviews changes or upgrades to existing designs or testExercises judgment in selecting methods and techniques for obtaining solutions on assignmentsQualifications:All other Regions:Bachelor's Degree1 to 2 years of experienceQuantitative and problem solving skillsTo protect candidates from falling victim to online fraudulent activity involving fake job postings and employment offers, please be aware our recruiters will always connect with you via @zebra.com email accounts. Applications are only accepted through our applicant tracking system and only accept personal identifying information through that system.  Our Talent Acquisition team will not ask for you to provide personal identifying information via e-mail or outside of the system. If you are a victim of identity theft contact your local police department.",
      "requirements": "N/A",
      "employment_type": "N/A",
      "experience_level": "N/A",
      "department": "N/A",
      "company": "Zebra",
      "scraped_at": "2025-07-31 11:10:05",
      "page_number": 1,
      "source_url": "https://zebra.eightfold.ai/careers?location=India"
    },
    {
      "title": "Jobs at Zebra",
      "location": "India×",
      "posted_date": "N/A",
      "apply_link": "https://zebra.eightfold.ai/careers?location=India&pid=343626971293&domain=zebra.com&sort_by=relevance",
      "description": "Remote Work: NoOverview: At Zebra, we are a community of innovators who come together to create new ways of working to make everyday life better. United by curiosity and care, we develop dynamic solutions that anticipate our customer’s and partner’s needs and solve their challenges.\n Being a part of Zebra Nation means being seen, heard, valued, and respected. Drawing from our diverse perspectives, we collaborate to deliver on our purpose. Here you are a part of a team pushing boundaries to redefine the work of tomorrow for organizations, their employees, and those they serve.\n You have opportunities to learn and lead at a forward-thinking company, defining your path to a fulfilling career while channeling your skills toward causes that you care about – locally and globally. We’ve only begun reimaging the future – for our people, our customers, and the world. Let’s create tomorrow together.Analyzes, develops, designs, and maintains software for the organization's products and systems. Performs system integration of software and hardware to maintain throughput and program consistency. Develops, validates, and tests: structures and user documentation. Work may be reviewed for accuracy and overall adequacy. Follows established processes and directions.Responsibilities:Establishes requirements for less complex design projectsWorks on Completing all phases of Software engineering design projectsWorks on analysis of processes and delivers results to necessary stakeholdersAnalyzes results and recommends solutionsWorks on developing expected results on a variety of productsDevelops documentation for new projects and reviews previous resultsWorks with latest technologies and new approachesReviews changes or upgrades to existing designs or testExercises judgment in selecting methods and techniques for obtaining solutions on assignmentsQualifications:All other Regions:Bachelor's Degree1 to 2 years of experienceQuantitative and problem solving skillsMandatory :-JavaData StructuresAngularMongoDB and SQLGood to Have :-DockerKubernetesGoogle CloudTo protect candidates from falling victim to online fraudulent activity involving fake job postings and employment offers, please be aware our recruiters will always connect with you via @zebra.com email accounts. Applications are only accepted through our applicant tracking system and only accept personal identifying information through that system.  Our Talent Acquisition team will not ask for you to provide personal identifying information via e-mail or outside of the system. If you are a victim of identity theft contact your local police department.",
      "requirements": "N/A",
      "employment_type": "N/A",
      "experience_level": "N/A",
      "department": "N/A",
      "company": "Zebra",
      "scraped_at": "2025-07-31 11:10:44",
      "page_number": 1,
      "source_url": "https://zebra.eightfold.ai/careers?location=India"
    },
    {
      "title": "Jobs at Zebra",
      "location": "India×",
      "posted_date": "N/A",
      "apply_link": "https://zebra.eightfold.ai/careers?location=India&pid=343626459976&domain=zebra.com&sort_by=relevance",
      "description": "Remote Work: NoOverview:At Zebra, we are a community of innovators who come together to create new ways of working to make everyday life better. United by curiosity and care, we develop dynamic solutions that anticipate our customer’s and partner’s needs and solve their challenges.Being a part of Zebra Nation means being seen, heard, valued, and respected. Drawing from our diverse perspectives, we collaborate to deliver on our purpose. Here you are a part of a team pushing boundaries to redefine the work of tomorrow for organizations, their employees, and those they serve.You have opportunities to learn and lead at a forward-thinking company, defining your path to a fulfilling career while channeling your skills toward causes that you care about – locally and globally. We’ve only begun reimaging the future – for our people, our customers, and the world.Let’s create tomorrow together.We are seeking a dynamic and skilled professional to join our team in a hybrid role encompassing both Site Reliability Engineering (SRE) and DevOps. The ideal candidate will be responsible for managing and optimizing our cloud infrastructure on Google Cloud Platform (GCP) and Microsoft Azure. Key responsibilities include developing automated systems for monitoring and incident response, collaborating on CI/CD pipelines using GitHub Actions, and implementing infrastructure as code with Terraform. Strong troubleshooting skills, proficiency in Shell and Python scripting, and expertise in Linux and Kubernetes are essential. The candidate should possess a proactive approach to monitoring and system management, ensuring high availability, performance, and security across our cloud environments.Responsibilities:Cloud Infrastructure Management:Design, implement, and manage scalable and reliable cloud infrastructure on Google Cloud Platform (GCP) and Microsoft Azure.Optimize cloud resource utilization and costs while ensuring high availability and performance.Site Reliability Engineering (SRE):Develop and maintain automated systems for monitoring, alerting, and incident response to ensure system reliability and uptime.Implement best practices for incident management, including root cause analysis and post-mortem documentation.DevOps Practices:Collaborate with development teams to integrate and deploy code using CI/CD pipelines with GitHub Actions.Automate routine tasks and deployment processes to improve efficiency and reduce time to market.Troubleshooting and Problem Solving:Provide expert troubleshooting for complex technical issues across the infrastructure, applications, and networks.Analyze system performance and reliability, proposing enhancements and optimizations.Infrastructure as Code (IaC):Develop and manage infrastructure using Terraform, ensuring reproducibility and scalability of cloud resources.Maintain version-controlled Terraform configurations in GitHub, enabling collaborative development and change tracking.Scripting and Automation:Develop and maintain automation scripts using Shell and Python to streamline operations and enhance productivity.Create and manage infrastructure as code (IaC) using tools like Terraform or similar.Linux and Kubernetes Administration:Manage and maintain Linux-based systems, ensuring security, patching, and configuration management.Deploy, configure, and manage Kubernetes clusters, ensuring robust container orchestration.Monitoring and Proactive Management:Implement and maintain comprehensive monitoring solutions to track system health and performance.Proactively identify potential issues and implement solutions before they impact users.Security and Compliance:Ensure cloud environments comply with organizational security policies and industry best practices.Implement security measures to protect data and applications from external threats.Qualifications:Minimum 4+ Years of experience in Cloud Development.To protect candidates from falling victim to online fraudulent activity involving fake job postings and employment offers, please be aware our recruiters will always connect with you via @zebra.com email accounts. Applications are only accepted through our applicant tracking system and only accept personal identifying information through that system. Our Talent Acquisition team will not ask for you to provide personal identifying information via e-mail or outside of the system. If you are a victim of identity theft contact your local police department.",
      "requirements": "N/A",
      "employment_type": "N/A",
      "experience_level": "N/A",
      "department": "N/A",
      "company": "Zebra",
      "scraped_at": "2025-07-31 11:11:23",
      "page_number": 1,
      "source_url": "https://zebra.eightfold.ai/careers?location=India"
    },
    {
      "title": "Jobs at Zebra",
      "location": "India×",
      "posted_date": "N/A",
      "apply_link": "https://zebra.eightfold.ai/careers?location=India&pid=343625945791&domain=zebra.com&sort_by=relevance",
      "description": "N/A",
      "requirements": "N/A",
      "employment_type": "N/A",
      "experience_level": "N/A",
      "department": "N/A",
      "company": "Zebra",
      "scraped_at": "2025-07-31 11:12:02",
      "page_number": 1,
      "source_url": "https://zebra.eightfold.ai/careers?location=India"
    },
    {
      "title": "Jobs at Zebra",
      "location": "India×",
      "posted_date": "N/A",
      "apply_link": "https://zebra.eightfold.ai/careers?location=India&pid=343625905268&domain=zebra.com&sort_by=relevance",
      "description": "Remote Work: HybridOverview: At Zebra, we are a community of innovators who come together to create new ways of working to make everyday life better. United by curiosity and care, we develop dynamic solutions that anticipate our customer’s and partner’s needs and solve their challenges.\n Being a part of Zebra Nation means being seen, heard, valued, and respected. Drawing from our diverse perspectives, we collaborate to deliver on our purpose. Here you are a part of a team pushing boundaries to redefine the work of tomorrow for organizations, their employees, and those they serve.\n You have opportunities to learn and lead at a forward-thinking company, defining your path to a fulfilling career while channeling your skills toward causes that you care about – locally and globally. We’ve only begun reimaging the future – for our people, our customers, and the world. Let’s create tomorrow together.Takes ownership of assigned end-user account(s) or territory; develops and executes sales strategy for assigned account(s) or territory with manager's input; develops strong relationships with key customer contacts and leverages to Zebra's advantage; creates and delivers high impact sales presentations and capable of product training; often used for those with strong technical background but limited sales experience or strong sales with limited product/market understanding.Responsibilities:Knowledge/ExpertiseTechnical Skills - Uses moderate domain/solutions knowledgeKnowledge of Zebra - Utilizes solid understanding of all Products/Services in businessSales Skills - Applies Solution Selling concepts to customer situations; excellent communication and interpersonal skillsManagerial Skills - Understands policies and practices related to role and shares ideas for improvementBusiness Acumen - Understands and explains how Zebra solutions can help customer's business results; obtains profitable revenue growth via value proposition vs. competitionMarket/customer Knowledge - Uses full knowledge of customer's business and market economics/trends to position effectively versus competitionSolution Complexity/Strategic ThinkingNature of Problems Solved - Solves routine problems of moderate complexity (e.g. verifying technical compatibility) at the customer levelRole in Addressing Problems - Understands and resolves problems with support from technical resourcesComplexity of Solutions - Typically medium complexity (e.g. value proposition vs. competition), but may have some complex projects that require unique coordination of technical resourcesFreedom to ActLevel of Guidance - Works under general supervision. Makes decisions of moderate complexity that impact deliverables of projects; exercises judgment in approach, sometimes requiring and assessing tradeoffsTakes Direction From - Group Manager and DirectorsCustomer InterfaceRole - Acts independently or as a team lead for ad-hoc teamsLevel of Customer Contact - Buyers/decision makers for small and mid-sized deals and end usersMain Level of Interaction - Responsible for influencing the customer to purchase moderate size projectsRequired Knowledge of Customer - Operational strategies for success and competitorsAccountabilityBusiness and Financial Impact - Responsible for individual revenue attainment with established prices and personal expensesRelative Size and Scope - Moderate to average individual quota size for business and like rolesTypes of Projects - Many transactions with some moderately complex dealsStrategic Impact for Zebra - Medium/mid-termQualifications:Bachelors or equivalent experience2-5 years of applicable work experienceUses moderate domain/solutions knowledgeApplies Solution Selling concepts to customer situations; excellent communication and interpersonal skillsUnderstands policies and practices related to role and shares ideas for improvementThis position base location is NOIDA.To protect candidates from falling victim to online fraudulent activity involving fake job postings and employment offers, please be aware our recruiters will always connect with you via @zebra.com email accounts. Applications are only accepted through our applicant tracking system and only accept personal identifying information through that system.  Our Talent Acquisition team will not ask for you to provide personal identifying information via e-mail or outside of the system. If you are a victim of identity theft contact your local police department.",
      "requirements": "N/A",
      "employment_type": "N/A",
      "experience_level": "N/A",
      "department": "N/A",
      "company": "Zebra",
      "scraped_at": "2025-07-31 11:12:41",
      "page_number": 1,
      "source_url": "https://zebra.eightfold.ai/careers?location=India"
    }
  ]
}